In [1]:
import pandas as pd

In [19]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]

l3 = [{'age': 25, 'job': "dentist"},
      {'age': 30, 'job': "farmer"},
      {'age': 20, 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])
df3 = pd.DataFrame(l3, columns = ['age', 'job'])

In [20]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [21]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [22]:
result = pd.concat([df1, df2])

In [23]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

인덱스는 기존 값 그대로 들어감

그래서 ignore_index = True 사용

In [24]:
result = pd.concat([df1, df2], ignore_index = True)

In [25]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [26]:
result = df1.append(df2, ignore_index = True)

C:\Users\a0102\AppData\Local\Temp\ipykernel_8016\1012111661.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  result = df1.append(df2, ignore_index = True)

In [27]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [28]:
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df3 = pd.DataFrame(l3, columns = ['age', 'job'])

In [29]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [30]:
df3

   age       job
0   25   dentist
1   30    farmer
2   20  designer

In [31]:
result = pd.concat([df1, df2], axis=1, ignore_index=True)

In [32]:
result

      0          1     2         3
0  John    teacher    Ed   dentist
1  Nate    student  Jack    farmer
2  Fred  developer   Ted  designer

리스트 합치기

In [33]:
label = [1,2,3,4,5]
pre = [1,2,2,4,4]

In [36]:
com = pd.DataFrame({'label' : label, 'pre' : pre})

In [37]:
com

   label  pre
0      1    1
1      2    2
2      3    2
3      4    4
4      5    4